---
kind: type
id: T:Autodesk.Revit.DB.UnitFormatUtils
source: html/bd635989-6abd-3486-2c34-64571370065b.htm
---
# Autodesk.Revit.DB.UnitFormatUtils

A utility class for formatting and parsing numbers with units.

## Syntax (C#)
```csharp
public static class UnitFormatUtils
```